Project/Toir/src/Documents/торо_ПринятиеОРКУчету/торо_ПринятиеОРКУчету.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПринятиеОРКУчету</name>
  <registerRecords>InformationRegister.торо_СтатусыОбъектовРемонтаВУчете</registerRecords>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекСтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВСостав</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПодчиненныхПринятыхКУчету</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринятьКУчету</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_СтатусыОбъектовРемонтаВУчете/торо_СтатусыОбъектовРемонтаВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыОбъектовРемонтаВУчете</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусОР</name>
    <type>
      <types>EnumRef.торо_СтатусыОРВУчете</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_СтатусыОРВУчете/торо_СтатусыОРВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыОРВУчете</name>
  <enumValues>
    <name>ПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ПринятиеОРКУчету/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа
перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		ОбъектРемонта = ДанныеЗаполнения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		Подразделение = ОбъектРемонта.Подразделение;
		Организация = ОбъектРемонта.Организация;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекСтруктураИерархии) Тогда
		ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяСтруктураИерархии");
	КонецЕсли;
	
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТабПодчиненные.ОбъектРемонта КАК ОбъектРемонта
		|ПОМЕСТИТЬ ВТ_ОР
		|ИЗ
		|	&ТабПодчиненные КАК ТабПодчиненные
		|ГДЕ
		|	ТабПодчиненные.ПринятьКУчету
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.СтатусОР КАК СтатусОР,
		|	торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних(
		|			,
		|			ОбъектРемонта В
		|					(ВЫБРАТЬ
		|						ВТ_ОР.ОбъектРемонта КАК ОбъектРемонта
		|					ИЗ
		|						ВТ_ОР КАК ВТ_ОР)
		|				И Регистратор <> &Ссылка) КАК торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних
		|ГДЕ
		|	торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.СтатусОР = ЗНАЧЕНИЕ(Перечисление.торо_СтатусыОРВУчете.ПринятоКУчету)";
		
		Запрос.УстановитьПараметр("ТабПодчиненные", СписокПодчиненныхПринятыхКУчету);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ВыгрузкаИзРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрУжеПринятКУчету Из ВыгрузкаИзРезультатаЗапроса Цикл
			СтрПодчиненныйОР = СписокПодчиненныхПринятыхКУчету.Найти(СтрУжеПринятКУчету.ОбъектРемонта,"ОбъектРемонта");
			СтрПодчиненныйОР.ПринятьКУчету = Ложь;
			
			ШаблонСообщения = НСтр("es='¡El objeto de la reparación %1 es aceptado ya al recuento por el documento %2! La marca de la aceptación al recuento para él es quitada.';ru='Объект ремонта %1 уже принят к учету документом %2! Пометка принятия к учету для него снята.';en='Repair object%1 has already been taken into account by document%2! The mark of acceptance for accounting has been removed for him.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрУжеПринятКУчету.ОбъектРемонта, СтрУжеПринятКУчету.Регистратор);
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ОбъектРемонта) Тогда
		ДатаВыпуска = ОбъектРемонта.ДатаВыпуска;
		Если ЗначениеЗаполнено(ДатаВводаВЭксплуатацию) И ДатаВводаВЭксплуатацию < ДатаВыпуска Тогда
			ШаблонСообщения = НСтр("es='Para el objeto de la reparación <%1> la fecha de la introducción en la explotación es más pequeña que la fecha de la salida del objeto de la reparación: %2.';ru='Для объекта ремонта <%1> дата ввода в эксплуатацию меньше даты выпуска объекта ремонта: %2.';en='For repair object <%1>, the commissioning date is less than the release date of the repair item:%2.'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектРемонта, Формат(ДатаВыпуска,"ДФ=dd.MM.yyyy"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);										
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроверитьНаличиеБолееПозднихДокументов(Отказ);
	ПроверитьЧтоОРНеПринятКУчету(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.торо_СтатусыОбъектовРемонтаВУчете.Записывать = Истина;
	НаборЗаписей = Движения.торо_СтатусыОбъектовРемонтаВУчете;

	НС = НаборЗаписей.Добавить();
	НС.ОбъектРемонта     = ОбъектРемонта;
	НС.Период            = ДатаВводаВЭксплуатацию;
	НС.СтатусОР          = Перечисления.торо_СтатусыОРВУчете.ПринятоКУчету;
	
	Для Каждого ПодчиненныйОР Из СписокПодчиненныхПринятыхКУчету Цикл
		Если Не ПодчиненныйОР.ПринятьКУчету Тогда
			Продолжить;
		КонецЕсли;
		НС = НаборЗаписей.Добавить();
		НС.ОбъектРемонта     = ПодчиненныйОР.ОбъектРемонта;
		НС.Период            = ДатаВводаВЭксплуатацию;
		НС.СтатусОР          = Перечисления.торо_СтатусыОРВУчете.ПринятоКУчету;
	КонецЦикла;
	
	Попытка
		
		ОбъектРемонтаОбъект = ОбъектРемонта.ПолучитьОбъект();
		ОбъектРемонтаОбъект.ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатацию;
		
		Структура = торо_СтатусыОРВУчете.НастройкиСтатуса(Перечисления.торо_СтатусыОРВУчете.ПринятоКУчету);
		Если Структура <> Неопределено Тогда
			ОбъектРемонтаОбъект.НеУчаствуетВПланировании = Структура.ЗначениеПоУмолчанию;
		КонецЕсли;
		ОбъектРемонтаОбъект.Записать();
		
		Для Каждого ПодчиненныйОР Из СписокПодчиненныхПринятыхКУчету Цикл
			Если Не ПодчиненныйОР.ПринятьКУчету Тогда
				Продолжить;
			КонецЕсли;
			ОбъектРемонтаОбъект = ПодчиненныйОР.ОбъектРемонта.ПолучитьОбъект();
			ОбъектРемонтаОбъект.ДатаВводаВЭксплуатацию = ДатаВводаВЭксплуатацию;
			
			Структура = торо_СтатусыОРВУчете.НастройкиСтатуса(Перечисления.торо_СтатусыОРВУчете.ПринятоКУчету);
			Если Структура <> Неопределено Тогда
				ОбъектРемонтаОбъект.НеУчаствуетВПланировании = Структура.ЗначениеПоУмолчанию;
			КонецЕсли;
			ОбъектРемонтаОбъект.Записать();
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("Исключение",УровеньЖурналаРегистрации.Ошибка,,Ссылка,ОписаниеОшибки());
		ТекстСообщения = НСтр("es='La anotación no es cumplida.';ru='Запись не выполнена.';en='Writing failed.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецПопытки; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроверитьНаличиеБолееПозднихДокументов(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ОбъектРемонтаОбъект = ОбъектРемонта.ПолучитьОбъект();
		Структура = торо_СтатусыОРВУчете.НастройкиСтатуса(Перечисления.торо_СтатусыОРВУчете.НеПринятоКУчету);
		Если Структура <> Неопределено Тогда
			ОбъектРемонтаОбъект.НеУчаствуетВПланировании = Структура.ЗначениеПоУмолчанию;
		КонецЕсли;
		ОбъектРемонтаОбъект.Записать();
		
	Исключение
		ЗаписьЖурналаРегистрации("Исключение",УровеньЖурналаРегистрации.Ошибка,,Ссылка,ОписаниеОшибки());
		ТекстСообщения = НСтр("es='La anotación no es cumplida.';ru='Запись не выполнена.';en='Writing failed.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецПопытки; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеБолееПозднихДокументов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_СтатусыОбъектовРемонтаВУчете.Период КАК ДатаВводаВЭксплуатацию,
	|	торо_СтатусыОбъектовРемонтаВУчете.Регистратор КАК Регистратор,
	|	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта,
	|	торо_СтатусыОбъектовРемонтаВУчете.СтатусОР
	|ИЗ
	|	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете КАК торо_СтатусыОбъектовРемонтаВУчете
	|ГДЕ
	|	торо_СтатусыОбъектовРемонтаВУчете.ОбъектРемонта = &ОбъектРемонта
	|	И торо_СтатусыОбъектовРемонтаВУчете.Регистратор <> &Регистратор
	|	И торо_СтатусыОбъектовРемонтаВУчете.Период >= &ДатаВводаВЭксплуатацию";
	
	Запрос.УстановитьПараметр("ОбъектРемонта",          ОбъектРемонта);
	Запрос.УстановитьПараметр("ДатаВводаВЭксплуатацию", ДатаВводаВЭксплуатацию);
	Запрос.УстановитьПараметр("Регистратор",            Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		// Проверка на наличие документов после указанный даты ввода в эксплуатацию.
		ШаблонСообщения = НСтр("es='Para el objeto de la reparación <%1> hay unos documentos a la fecha misma o más avanzada';ru='Для объекта ремонта <%1> имеются документы на ту же или более позднюю дату';en='Documents for the same or later date are available for repair object <%1>'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектРемонта);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЧтоОРНеПринятКУчету(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних.СтатусОР КАК СтатусОР
	|ИЗ
	|	РегистрСведений.торо_СтатусыОбъектовРемонтаВУчете.СрезПоследних(&Период, ОбъектРемонта = &ОбъектРемонта) КАК торо_СтатусыОбъектовРемонтаВУчетеСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ДатаВводаВЭксплуатацию-1);
	Запрос.УстановитьПараметр("ОбъектРемонта", ОбъектРемонта);
	
	ПринятКУчету = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.СтатусОР = Перечисления.торо_СтатусыОРВУчете.ПринятоКУчету Тогда
			ПринятКУчету = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ПринятКУчету Тогда
		ШаблонСообщения = НСтр("es='Del objeto de la reparación <%1> es aceptado ya al recuento a la fecha de %2';ru='Объекта ремонта <%1> уже принят к учету на дату %2';en='Repair object <%1> is already accepted for accounting as of date%2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения,	ОбъектРемонта, ДатаВводаВЭксплуатацию);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#КонецЕсли
